// Обработка исключений понять как работает

/*
 АТД
 1) описывает набор операций
 - создание/уничтожение
 - изменение
 - получение описания
 Примеры атд(число, строка, массив, стек, очередь

 Структура данных(способ организации и манипуляции данными)
 - реализация АТД
 Примеры: кортеж, массив, список, дерево, граф

 49 Инвариант типа в 5 лекции
 1) состояние экземпляра
 - Значения всех переменных
 - Может изменяться методами
 - Может изменяться прямым изменением полей
 2) Определяется типом
 3) Должен выполняться в начале и в конце каждого метода
 4) Может контролироваться assert

 13 АТД матрица
 - создание, уничтожение, копирование
 - Получение доступа к элементу по индексу
 - Получение размера
 - Изменение размера
 - печать
 */